{
  "intents": [
    {
      "tag": "chatbot",
      "patterns": [
        "What's your name?",
        "What is your name",
        "Who are you?",
        "Can you help me?",
        "Tell me about yourself",
        "What can you do?",
        "What is your name?",
        "May I know your name?",
        "Could you tell me your name?",
        "How should I address you?",
        "Can you share your name with me?",
        "Who are you?",
        "What do they call you?",
        "What should I call you?",
        "What is your full name?",
        "How do I refer to you?"
      ],
      "responses": [
        "I'm SRMINFO, your virtual assistant here to help with admissions, course info, and more.",
        "My name is SRMINFO. I'm here to assist you with any questions you have about SRM Ramapuram."
      ]
    },
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Good day",
        "Hey",
        "What's up?",
        "Greetings",
        "Hi are you available to help me?",
        "Hello! Can you assist me with something?",
        "Hey! Can I ask you something?",
        "Good morning! Are you here to answer my questions?",
        "Hi there! Is this the SRM Ramapuram chatbot?",
        "Hello! Can you guide me through the campus services?",
        "Good afternoon! Can you help me find some information?",
        "Hey, can you provide details about SRM Ramapuram?",
        "Greetings! Can you help me with campus directions?",
        "Hi! Do you offer assistance for SRM Ramapuram queries?"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi there! What can I do for you?",
        "Good day! How may I help you?",
        "Hello, how can I make your day easier?",
        "Hi! What can I help you with?",
        "Good day! What brings you here today?",
        "Hey! How can I be of service?",
        "Welcome! How can I assist you at SRM Ramapuram?",
        "Greetings! How may I help you?",
        "Hello there! Need any assistance?",
        "Hi! What would you like to know?",
        "Good to see you! How can I guide you today?",
        "How can I make your day better today?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Goodbye",
        "Bye",
        "thank you",
        "See you later",
        "Take care",
        "Goodbye!",
        "Bye! You've been helpful.",
        "I am done, thanks! Bye!",
        "That's all for now, goodbye!",
        "I will talk to you later, goodbye!",
        "Thanks for the help! See you later.",
        "Okay, I am leaving now. Bye!",
        "I appreciate the information. Bye for now!",
        "That's it, I'm signing off! Take care.",
        "Thanks! I will reach out again if I need more help. Bye!"
      ],
      "responses": [
        "Goodbye! Feel free to reach out if you need more information.",
        "See you later! Have a great day ahead.",
        "Take care! Let me know if you have more questions.",
        "You're welcome! Goodbye, and have a great day ahead!",
        "I'm glad I could help! Take care, and feel free to reach out again!",
        "Anytime! Goodbye, and don't hesitate to ask if you need more assistance.",
        "Got it! See you next time. Have a great day!",
        "Talk to you soon! Have a good one.",
        "Happy to help! See you later, take care.",
        "Take care! Goodbye!",
        "Glad I could assist! Bye for now, feel free to ask more anytime.",
        "Signing off! Take care, and feel free to return for more queries.",
        "You're always welcome! Goodbye, and I'm here whenever you need assistance."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "I appreciate it",
        "That's helpful",
        "You are the best",
        "Thank you for your help!",
        "Thanks, I appreciate it!",
        "That was helpful, thanks!",
        "I really appreciate your assistance!",
        "Thanks a lot for the information!",
        "You have been a great help, thanks!",
        "Thanks for the quick response!",
        "Thanks for clarifying that!",
        "I am grateful for your assistance, thank you!",
        "Thank you! You answered all my questions."
      ],
      "responses": [
        "You're welcome! Glad I could help.",
        "Happy to assist! Let me know if you need anything else.",
        "Anytime! Feel free to ask more questions.",
        "You're welcome! Glad I could assist.",
        "Happy to help! Let me know if you need anything else.",
        "I'm glad it was helpful! Feel free to ask more if needed.",
        "It's my pleasure! Don't hesitate to reach out anytime.",
        "You're welcome! Let me know if you need more information.",
        "I'm here to help! Anytime you need assistance, just ask.",
        "No problem at all! Happy to provide a quick response.",
        "Glad I could clear things up for you!",
        "You're very welcome! I'm always here to assist you.",
        "I'm happy I could answer everything! Reach out if you need anything else."
      ]
    },
    {
      "tag": "admissions_general",
      "patterns": [
        "Can you tell me what the admission process for SRM Ramapuram ?",
        "can you tell me about the admission process",
        "What is the admission process like?",
        "Could you explain the admission process?",
        "What is the admission process?",
        "How do I get admitted?",
        "Can you explain admissions?",
        "What is the way to apply?",
        "How do I apply for admission?",
        "What do I need for admission?",
        "What happens in the admission process?",
        "How can I get in?",
        "What are the steps to apply?",
        "Tell me how to apply.",
        "How does the admission process work?",
        "What steps are involved in the admission process?",
        "Can you describe the admission process for me?",
        "What do I need to know about the admission process?",
        "Is there an admission process I should follow?",
        "How can I learn about the admission process?",
        "What should I do for the admission process?",
        "tell me about the admission process",
        "explain me about the admission process",
        "Please explain what the admission process for SRM Ramapuram",
        "Would you let me know what the admission process for SRM Ramapuram entails?",
        "Could you provide details about what the admission process for SRM Ramapuram?",
        "What steps are involved in the admission process for SRM Ramapuram?",
        "Can you share what the admission process for SRM Ramapuram looks like?",
        "I would like to know what the admission process for SRM Ramapuram involves.",
        "What are the requirements for the admission process for SRM Ramapuram?",
        "Can you outline the admission process for SRM Ramapuram?",
        "What should I know about the admission process for SRM Ramapuram?"
      ],
      "responses": [
        "The admission process for SRM Ramapuram requires candidates to meet eligibility criteria and take the SRMJEEE entrance exam. After filling out the online application form, qualified candidates attend a counseling session to select their courses based on exam ranks. Document verification and fee payment follow to secure admission. For updates and important dates, it's best to check the official SRM website <a href ='https://srmrmp.edu.in/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "admissions_entrance",
      "patterns": [
        "Do I need to take any entrance exams?",
        "What entrance exams do I need for admission?",
        "Are entrance exams necessary for admission?",
        "Is there an entrance exam for admission?",
        "What exams are required for admission?",
        "Do I have to pass an entrance exam?",
        "Are there exams I must take for admission?",
        "Can you tell me about entrance exams for admission?",
        "Is an entrance exam required to apply?",
        "What tests do I need for admission?",
        "Do I need to take a test?",
        "Is there a test for admission?",
        "What test do I need to take?",
        "Do I have to pass a test?",
        "Are tests needed for admission?",
        "Is an entrance test required?",
        "What exams should I take?",
        "Do I need to do any exams?",
        "Is there an entrance exam?",
        "Can you tell me about the tests for admission?",
        "Is a test needed?",
        "Do I take a test?",
        "What test do I take?",
        "Do I need to test?",
        "Is there a test?",
        "Are tests needed?",
        "Must I take a test?",
        "Is a test required?",
        "Do I have to take an exam?"
      ],
      "responses": [
        "Yes, entrance exams like the SRMJEEE are required for admission to certain programs at SRM. Please check the official website for specific exam details <a href ='https://srmrmp.edu.in/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "admissions_documents",
      "patterns": [
        "What papers do I need for admission?",
        "Can you tell me what documents I need to submit?",
        "What do I need to provide for admission?",
        "Are there any papers I need for admission?",
        "What documents should I bring for admission?",
        "Do I need to submit any documents?",
        "What should I submit for the admission process?",
        "What is needed for the admission documents?",
        "What items do I need for admission?",
        "What documents do I need to apply?",
        "What do I need to submit?",
        "What papers should I have?",
        "What documents do I bring?",
        "Do I need to show any papers?",
        "What items do I need?",
        "What should I give for admission?",
        "Is there a list of documents?",
        "What do I provide for admission?",
        "What do I need to show?",
        "What documents are needed?",
        "What should I bring?",
        "What papers do I need?",
        "Do I need any documents?",
        "What do I show for admission?",
        "What do I give you?",
        "What do I have to submit?",
        "Do I need to show anything?",
        "What is needed?",
        "What papers must I have?",
        "Is there anything I need to bring?"
      ],
      "responses": [
        "You typically need to submit your educational certificates, identification proof, and entrance exam scores for the admission process. Please check the official website for the exact document requirements <a href ='https://srmrmp.edu.in/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "application_form",
      "patterns": [
        "Can I get the application form link for SRM Ramapuram?",
        "Where can I find the link to the admission application form?",
        "Is there an online link to download the application form?",
        "Can you provide the URL for the admission application?",
        "How do I access the application form for SRM Ramapuram admissions?",
        "What is the link to apply for admission online?",
        "Where can I fill out the admission application form?",
        "Can I have the link to the SRM Ramapuram application page?",
        "Is there a specific website for the application form?",
        "Can you share the direct link to the application form?",
        "Can you give me the application form link for SRM Ramapuram?",
        "Where can I find the application form for SRM Ramapuram?",
        "Is there a link for the SRM Ramapuram application form?",
        "How do I get the application form for SRM Ramapuram?",
        "Can I have the link to the application form?",
        "What is the link for the SRM Ramapuram application?",
        "Can you share the application form link?",
        "Where is the application form link for SRM Ramapuram?",
        "Can you help me find the application form link?",
        "How can I access the application form for SRM Ramapuram?",
        "Where is the application form?",
        "Can I see the application form?",
        "How to get the application form?",
        "Can you show me the application form?",
        "Where do I find the form?",
        "Is there a form for applications?",
        "How can I find the application?",
        "Where can I get the application?",
        "Can I have the application?",
        "What is the application link?"
      ],
      "responses": [
        "You can access the application form for SRM Ramapuram <a href ='https://registration.srmrmp.edu.in/' target='_blank'>here</a>."
      ]
    },
    {
      "tag": "admissions_eligibility",
      "patterns": [
        "Can you tell me what the eligibility criteria for admission to SRM Ramapuram?",
        "Please explain what the eligibility criteria for admission to SRM Ramapuram",
        "Would you let me know what the eligibility criteria for admission to SRM Ramapuram entail?",
        "Could you provide details about what the eligibility criteria for admission to SRM Ramapuram ?",
        "What are the requirements for the eligibility criteria for admission to SRM Ramapuram?",
        "Can you share what the eligibility criteria for admission to SRM Ramapuram?",
        "I would like to know what the eligibility criteria for admission to SRM Ramapuram ?",
        "What should I know about the eligibility criteria for admission to SRM Ramapuram?",
        "Can you outline the eligibility criteria for admission to SRM Ramapuram?",
        "What are the basic eligibility criteria for admission to SRM Ramapuram?",
        "What is the eligibility criteria for SRM admission?",
        "Can you tell me the eligibility for SRM?",
        "What do I need to qualify for SRM?",
        "How can I be eligible for SRM?",
        "What are the requirements for SRM admission?",
        "Do I meet the eligibility for SRM?",
        "Can you explain SRM's eligibility criteria?",
        "What should I have to get into SRM?",
        "Is there a list of eligibility criteria for SRM?",
        "How do I know if I am eligible for SRM?",
        "What are the eligibility requirements?",
        "How can I qualify for SRM?",
        "Do I need specific marks for SRM?",
        "What do I need to apply to SRM?",
        "Am I eligible for SRM?",
        "What is needed for admission?",
        "Can you tell me the requirements for SRM?",
        "What should I have to join SRM?",
        "Is there an eligibility list for SRM?",
        "How do I check my eligibility?"
      ],
      "responses": [
        "To be eligible for admission to SRM Ramapuram, candidates generally need to have completed their higher secondary education (12th grade) with the required marks. Specific programs may have additional criteria, so it's best to check the official SRM website for details<a href ='https://srmrmp.edu.in/admission-srm-ramapuram/eligibility-criteria/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "admissions_eligibility_btech",
      "patterns": [
        "What do I need to qualify for BTech?",
        "Can you tell me the eligibility for BTech?",
        "What are the requirements for BTech?",
        "Who can apply for BTech?",
        "What is needed to get into BTech?",
        "What is the criteria for BTech admission?",
        "Do I meet the eligibility for BTech?",
        "What are the BTech eligibility rules?",
        "What qualifications do I need for BTech?",
        "Can I apply for BTech?",
        "Can I apply for BTech?",
        "What do I need for BTech?",
        "Do I qualify for BTech?",
        "What are the rules for BTech?",
        "What is needed for BTech?",
        "What marks do I need for BTech?",
        "Who can study BTech?",
        "What is the requirement for BTech?",
        "Is there an age limit for BTech?",
        "What subjects are needed for BTech?",
        "Can I do BTech?",
        "What do I need to join BTech?",
        "Am I eligible for BTech?",
        "What is required for BTech?",
        "What grades do I need for BTech?",
        "Who can study BTech?",
        "Do I need certain subjects for BTech?",
        "Is there a minimum age for BTech?",
        "What is needed for BTech admission?",
        "Can anyone apply for BTech?"
      ],
      "responses": [
        "Applicant should have passed in Higher secondary examination (10, +2 pattern) or appearing in Higher Secondary examination in the current academic year with a minimum of 60% aggregate  ( 3 subjects) in Physics (mandatory) , Mathematics (mandatory) and at least one of Chemistry / Biotechnology / Biology / Computer Science. Should have attained the age of 16 years and 6 months on the 31st July of the calendar year in which the 12th Board examination is to be held <a href ='https://srmrmp.edu.in/admission-srm-ramapuram/eligibility-criteria/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "admissions_eligibility_Barch",
      "patterns": [
        "What do I need to qualify for BArch?",
        "Can you tell me the eligibility for BArch?",
        "What are the requirements for BArch?",
        "Who can apply for BArch?",
        "what is the eligibility criteria for barch",
        "what are the eligibility criteria for barch",
        "What is needed to get into BArch?",
        "What is the criteria for BArch admission?",
        "Do I meet the eligibility for BArch?",
        "What are the BArch eligibility rules?",
        "What qualifications do I need for BArch?",
        "Can I apply for BArch?",
        "Can I do BArch?",
        "What do I need to join BArch?",
        "Am I eligible for BArch?",
        "What is required for BArch?",
        "What grades do I need for BArch?",
        "Who can study BArch?",
        "Do I need certain subjects for BArch?",
        "Is there a minimum age for BArch?",
        "What is needed for BArch admission?",
        "Can anyone apply for BArch?",
        "What do I need to qualify for BArch architecture?",
        "Can you tell me the eligibility for BArch architecture?",
        "What are the requirements for BArch architecture?",
        "Who can apply for BArch architecture?",
        "What is needed to get into BArch architecture?",
        "What is the criteria for BArch architecture admission?",
        "Do I meet the eligibility for BArch architecture?",
        "What are the BArch architecture eligibility rules?",
        "What qualifications do I need for BArch architecture?",
        "Can I apply for BArch architecture?",
        "Can I do BArch architecture?",
        "What do I need to join BArch architecture?",
        "Am I eligible for BArch architecture?",
        "What is required for BArch architecture?",
        "What grades do I need for BArch architecture?",
        "Who can study BArch architecture?",
        "Do I need certain subjects for BArch architecture?",
        "Is there a minimum age for BArch architecture?",
        "What is needed for BArch architecture admission?",
        "Can anyone apply for BArch architecture?",
        "Can I study BArch architecture?",
        "What do I need for BArch architecture?",
        "Am I good for BArch architecture?",
        "What is needed for BArch?",
        "What grades for BArch?",
        "Who can take BArch?",
        "Do I need specific subjects for BArch?",
        "Is there an age limit for BArch?",
        "What is required to get into BArch?",
        "Can I apply for BArch?"
      ],
      "responses": [
        "No candidate shall be admitted to architecture course unless she/ he has passed an examination at the end of the 10+2 scheme of examination with at least 60% aggregate marks in Physics, Chemistry & Mathematics and also at least 60% marks in aggregate of the 10+2 level examination or passed 10+3 Diploma Examination with Mathematics as compulsory subject with at least 60% marks in aggregate.<a href ='https://srmrmp.edu.in/' target='_blank'>click here</a>"
      ]
    },
    {
      "tag": "admissions_fees",
      "patterns": [
        "How much are the fees for courses at SRM Ramapuram?",
        "Can you tell me the fees for different courses?",
        "What is the cost of courses at SRM Ramapuram?",
        "What are the fees for SRM Ramapuram courses?",
        "How much does it cost to study at SRM Ramapuram?",
        "What are the course fees at SRM?",
        "Can you share the fees for various courses?",
        "What are the prices for the courses at SRM Ramapuram?",
        "How much do I pay for courses at SRM Ramapuram?",
        "What are the tuition fees for SRM Ramapuram courses?"
      ],
      "responses": [
        "The fees for various courses at SRM Ramapuram vary by program. Please check the official SRM website for the most accurate and up-to-date fee information <a href ='https://srmrmp.edu.in/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "admissions_status",
      "patterns": [
        "How can I check my admission status?",
        "Where do I check my application status?",
        "Can I see my admission status?",
        "How do I know if my application is accepted?",
        "How can I track my admission status?",
        "How do I find my application status?",
        "Where can I check the status of my admission?",
        "How do I know my application status?",
        "Can I check the status of my admission?",
        "How do I see my application progress?",
        "How do I see my status?",
        "Can I check my application?",
        "Where is my admission status?",
        "Is my application accepted?",
        "How do I know my status?",
        "Can I track my application?",
        "What is my admission status?",
        "Where is my application now?",
        "Can I see my admission progress?",
        "How do I find my application update?",
        "Where is my status?",
        "Is my application done?",
        "How is my application going?",
        "What is the status of my form?",
        "Did my admission go through?",
        "Is my form accepted?",
        "Where is my application now?",
        "Can I see my form status?",
        "Is my application approved?",
        "What is my form status?"
      ],
      "responses": [
        "You can check the status of your admission application by logging into the admission portal on the SRM website. Keep an eye on updates there <a href ='https://admissions.srmist.edu.in/srmistonline/applicationist/loginManager/youLogin.jsp' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "placements",
      "patterns": [
        "What are the placement options at SRM Ramapuram?",
        "Can you tell me about the placements at SRM Ramapuram?",
        "How are the placement opportunities at SRM Ramapuram?",
        "What is the placement process at SRM Ramapuram?",
        "Does SRM Ramapuram have good placements?",
        "What placement support is offered at SRM Ramapuram?",
        "What are the job opportunities after studying at SRM Ramapuram?",
        "How is the placement process at SRM Ramapuram?",
        "What are the placements at SRM?",
        "How are the placements in SRM?",
        "Does SRM have good placements?",
        "Can you tell me about SRM placements?",
        "Are there good job opportunities at SRM?",
        "Do students get placed at SRM?",
        "How does SRM help with placements?",
        "Does SRM have placements?",
        "How are jobs at SRM?",
        "Do companies visit SRM for jobs?",
        "Are placements good at SRM?",
        "Does SRM help with jobs?",
        "Can I get a job from SRM?",
        "What is the job process at SRM?",
        "How does SRM help students get jobs?",
        "What placement opportunities does SRM Ramapuram offer?",
        "Can you tell me about the placements at SRM Ramapuram?",
        "What kind of placements are available at SRM Ramapuram?",
        "How are the placements at SRM Ramapuram?",
        "What job opportunities are there at SRM Ramapuram?",
        "Does SRM Ramapuram have good placement options?",
        "Are there placement opportunities at SRM Ramapuram?",
        "How does SRM Ramapuram help with placements?",
        "Does SRM Ramapuram have placements?",
        "Can I get a job from SRM Ramapuram?",
        "Are there job opportunities at SRM Ramapuram?",
        "Do students get placed at SRM Ramapuram?",
        "Are there job opportunities at SRM Ramapuram?",
        "Can I get a placement at SRM Ramapuram?",
        "Does SRM Ramapuram help with placements?",
        "Does SRM help with jobs?",
        "Do students get jobs at SRM Ramapuram?",
        "Are there job placements at SRM?",
        "Can I find a job through SRM?",
        "Are there placements at SRM Ramapuram?",
        "Does SRM have good job options?",
        "Can I get placed from SRM Ramapuram?"
      ],
      "responses": [
        "SRM Ramapuram provides excellent placement opportunities with top companies visiting the campus each year.SRM provides 100% placements. The dedicated placement cell ensures students are well-prepared for interviews and job offers.Visit here for more info <a href ='https://srmrmp.edu.in/placement-3/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "placements_company",
      "patterns": [
        "what are all the companies that visit srm ramapuram",
        "Which companies visit the campus for placements?",
        "What companies come to the campus for placements?",
        "Can you tell me which companies visit the campus for placements?",
        "What companies offer placements at the campus?",
        "Who are the companies that come for placements?",
        "Which companies visit SRM Ramapuram for placements?",
        "What companies recruit at the campus?",
        "Can you list the companies that come for placements?",
        "What companies hire from the campus?",
        "What firms visit for placements?",
        "Which companies come for placements?",
        "Who hires from the campus?",
        "What companies come to SRM for placements?",
        "Which firms visit SRM for placements?",
        "Who recruits from the campus?",
        "What are the companies that hire from SRM?",
        "Which companies give jobs at SRM?",
        "Can you tell me the companies for placements?",
        "Who visits SRM for placements?",
        "What companies offer jobs at SRM?",
        "What companies come to SRM?",
        "Who comes for placements at SRM?",
        "Which companies hire from SRM?",
        "What firms come to SRM?",
        "Who offers jobs at SRM?",
        "Which companies give placements at SRM?",
        "What businesses visit SRM?",
        "Who recruits at SRM?",
        "What companies give jobs at SRM?"
      ],
      "responses": [
        "Top companies like Infosys,Wipro,TCS(Tata Consultancy Services),Cognizant,Accenture,HCL Technologies,Capgemini,Tech Mahindra,IBM,Amazon.The specific companies may vary each year based on industry demand and collaboration with the institution. For the most accurate and current information, it's best to check with the campus placement office or the official SRM Ramapuram website<a href ='https://srmrmp.edu.in/placement-3/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "placements_pay",
      "patterns": [
        "What salary packages are offered during placements at SRM Ramapuram?",
        "Can you tell me all the salary packages for placements at SRM Ramapuram?",
        "What are the salary offers during placements at SRM Ramapuram?",
        "What salary packages can I expect at SRM Ramapuram?",
        "What are the different salary packages during placements at SRM?",
        "Which salary packages are available for SRM Ramapuram students?",
        "What salaries do companies offer at SRM Ramapuram?",
        "What is the range of salary packages at SRM Ramapuram?",
        "Can you list the salary packages offered during placements at SRM?",
        "What are all the salary options at SRM Ramapuram during placements?",
        "What are the salaries at SRM?",
        "What salary packages can I get at SRM?",
        "How much do companies pay at SRM?",
        "What salaries are there for placements at SRM?",
        "Can you list the salary packages at SRM?",
        "What is the pay for SRM students?",
        "How much do students earn during placements?",
        "What are the pay options for SRM?",
        "What is the salary range at SRM Ramapuram?",
        "What salaries do graduates get at SRM?",
        "What is the pay at SRM?",
        "How much can I earn at SRM?",
        "What salaries do SRM students get?",
        "What is the salary at SRM?",
        "How much do companies pay at SRM?",
        "What is the salary for SRM grads?",
        "What are the job pays at SRM?",
        "How much do I make with SRM jobs?",
        "What is the pay package for SRM?",
        "How much do students earn at SRM?"
      ],
      "responses": [
        "During placements at SRM Ramapuram, salary packages typically range from 3 lakhs to 20 lakhs per annum, depending on the company and role.For more info <a href ='https://srmrmp.edu.in/placement-3/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "placements_highestpay",
      "patterns": [
        "What is the highest salary during placements at SRM Ramapuram?",
        "Can you tell me the highest salary package at SRM Ramapuram?",
        "What is the top salary offered at SRM Ramapuram?",
        "What is the highest pay package for placements at SRM?",
        "What is the maximum salary offered during placements at SRM?",
        "What is the best salary package available at SRM Ramapuram?",
        "What is the peak salary during placements at SRM?",
        "What is the highest salary for SRM graduates?",
        "Can you share the highest salary package for SRM students?",
        "What is the highest pay at SRM Ramapuram?",
        "What is the highest pay at SRM?",
        "How much is the top salary at SRM?",
        "What is the highest salary for SRM students?",
        "What is the best salary at SRM Ramapuram?",
        "What is the peak pay for placements at SRM?",
        "How much max can I earn at SRM?",
        "What is the max salary at SRM?",
        "What is the highest job pay at SRM?",
        "How much is the highest salary offered?",
        "What is the top pay package at SRM?",
        "What is the top pay at SRM?",
        "How much is the highest salary?",
        "What is the best pay at SRM?",
        "What is the highest salary for students?",
        "How much do SRM grads earn at maximum?",
        "What is the max pay at SRM?",
        "What is the highest job salary?",
        "What is the highest offer at SRM?",
        "What is the peak pay?"
      ],
      "responses": [
        "The highest salary package offered during placements at SRM Ramapuram can go up to 47.5 lakhs per annum, depending on the company and role.For more info <a href ='https://srmrmp.edu.in/placement-3/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "placements_averagepay",
      "patterns": [
        "What is the average salary during placements at SRM Ramapuram?",
        "Can you tell me the minimal salary package offered at SRM Ramapuram?",
        "What is the typical pay package for placements at SRM Ramapuram?",
        "What is the basic pay for graduates during placements at SRM Ramapuram?",
        "How much is the average pay package offered at SRM Ramapuram?",
        "What is the minimal pay for placements at SRM Ramapuram?",
        "What is the average salary package for SRM Ramapuram students?",
        "Can you tell me the typical salary offered during placements at SRM?",
        "What is the basic salary package for SRM Ramapuram graduates?",
        "What is the average minimal salary during placements at SRM?",
        "What is the average salary at SRM?",
        "What is the basic pay for SRM graduates?",
        "What is the typical salary from SRM placements?",
        "What is the minimal salary at SRM?",
        "How much is the average pay for SRM students?",
        "What is the average salary package for SRM placements?",
        "How much do companies pay averagely for SRM students?",
        "What is the average package for jobs from SRM?",
        "What is the average job salary from SRM?",
        "What is the typical pay for SRM jobs?",
        "How much is the basic salary for SRM grads?",
        "How much is the average pay at SRM?"
      ],
      "responses": [
        "The average salary package offered during placements at SRM Ramapuram is around 5 to 7 lakhs per annum, with some students receiving higher packages based on their skills and performance.For more info <a href ='https://srmrmp.edu.in/placement-3/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "srm_info",
      "patterns": [
        "What is SRM Ramapuram known for?",
        "Can you tell me about the history of SRM Ramapuram?",
        "Can you tell me about SRM Ramapuram?",
        "tell me about the significance of srm",
        "What is the significance of SRM?",
        "Can you tell me about SRM?",
        "What can you say about SRM?",
        "Please tell me about SRM.",
        "Tell me more about SRM.",
        "What is important about SRM?",
        "What are the key aspects of SRM?",
        "What is significant about SRM?",
        "Can you share details about SRM?",
        "What should I know about SRM?",
        "Why is SRM important?",
        "Can you explain the importance of SRM?",
        "What makes SRM significant?",
        "Why is SRM important?",
        "Tell me why SRM is significant.",
        "What does SRM stand for in terms of significance?",
        "How is SRM significant in education?",
        "What is the role of SRM in education?",
        "Why should I know about the significance of SRM?",
        "Can you describe the significance of SRM?",
        "Please tell me about SRM Ramapuram.",
        "Would you tell me about SRM Ramapuram?",
        "Could you tell me about SRM Ramapuram?",
        "Can you give me details about SRM Ramapuram?",
        "Can you share some information about SRM Ramapuram?",
        "I would like to know about SRM Ramapuram. Can you tell me?",
        "Would you mind telling me about SRM Ramapuram?",
        "Can you provide insights about SRM Ramapuram?",
        "What can you tell me about SRM Ramapuram?",
        "What is SRM Ramapuram?",
        "give me some insights about srm",
        "what are all the significance of srm",
        "Can you explain SRM Ramapuram?",
        "What can you tell me about SRM Ramapuram?",
        "How is SRM Ramapuram?",
        "insights about srm",
        "what is srm",
        "what are the information about srm",
        "tell me the information about srm",
        "what are the insights of srm",
        "What is special about SRM Ramapuram?",
        "Can you share details about SRM Ramapuram?",
        "What should I know about SRM Ramapuram?",
        "Can you describe SRM Ramapuram?",
        "What does SRM Ramapuram offer?",
        "How does SRM Ramapuram work?",
        "What is SRM Ramapuram?",
        "Tell me about SRM Ramapuram.",
        "How is SRM Ramapuram?",
        "What do you know about SRM Ramapuram?",
        "What happens at SRM Ramapuram?",
        "Can you describe SRM Ramapuram?",
        "What does SRM Ramapuram do?",
        "Is SRM Ramapuram a good school?",
        "What can I learn at SRM Ramapuram?",
        "Why is SRM Ramapuram special?",
        "what is srm special for",
        "tell me the basic information about srm"
      ],
      "responses": [
        "SRM Ramapuram, part of the SRM Institute of Science and Technology, is a premier educational institution in Chennai, Tamil Nadu, established in 2004. It offers a variety of undergraduate and postgraduate programs in engineering, management, and the arts, supported by modern infrastructure and experienced faculty. The campus fosters a vibrant student community with numerous clubs and activities, while a dedicated placement cell helps connect students with leading companies for internships and job opportunities. Overall, SRM Ramapuram is committed to providing quality education and practical experience, preparing students for successful careers."
      ]
    },
    {
      "tag": "academics_undergraduate",
      "patterns": [
        "What undergraduate courses does SRM offer?",
        "Can you tell me the UG courses at SRM?",
        "What are the UG programs at SRM?",
        "What can I study at SRM for undergrad?",
        "What are the undergrad courses at SRM?",
        "Tell me the UG programs in SRM.",
        "What are the available UG courses in SRM?",
        "Can you list the undergraduate courses at SRM?",
        "What undergrad degrees are offered at SRM?",
        "What are the bachelor's courses at SRM?",
        "What UG courses are there at SRM?",
        "What can I study at SRM?",
        "What are the courses for undergrad?",
        "What are the bachelor's programs at SRM?",
        "What degrees can I do at SRM?",
        "What UG programs does SRM have?",
        "Can you list SRM's undergrad courses?",
        "What are the SRM undergraduate options?",
        "What courses does SRM offer for UG?",
        "What can I take for undergrad at SRM?",
        "What undergraduate courses can I take at SRM?",
        "What can I study for undergrad?",
        "What degrees are at SRM?",
        "What are the UG options at SRM?",
        "What UG programs does SRM have?",
        "What undergrad courses are there?",
        "What can I do at SRM for UG?",
        "What are SRM's UG courses?",
        "What courses are available for undergrad?"
      ],
      "responses": [
        "SRM Ramapuram offers undergraduate courses in fields such as engineering, management, arts, and sciences <a href ='https://srmrmp.edu.in/admission-srm-ramapuram/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "academics_postgraduate",
      "patterns": [
        "What postgraduate courses does SRM offer?",
        "Can you tell me the PG courses at SRM?",
        "What are the PG programs at SRM?",
        "What can I study at SRM for postgrad?",
        "What are the postgraduate courses at SRM?",
        "Tell me the PG programs in SRM.",
        "What are the available PG courses in SRM?",
        "Can you list the postgraduate courses at SRM?",
        "What postgrad degrees are offered at SRM?",
        "What are the master is courses at SRM?",
        "What PG courses are at SRM?",
        "What can I study for postgrad?",
        "What are the courses for PG?",
        "What programs are at SRM for postgrad?",
        "Can you list SRM's PG courses?",
        "What are the SRM postgraduate options?",
        "What can I take for postgrad at SRM?",
        "What courses does SRM offer for PG?",
        "What can I apply for at SRM for postgrad?",
        "What courses can I take for PG?",
        "What can I study at SRM for postgrad?",
        "What are the degrees for postgrad?",
        "What PG programs are there?",
        "What can I do at SRM for PG?",
        "What PG courses does SRM have?",
        "Can you tell me about SRM's PG courses?",
        "What options do I have for postgrad?",
        "What are SRM's courses for PG?",
        "What can I apply for in PG at SRM?"
      ],
      "responses": [
        "We offer the following postgraduate courses:\n- M.Tech in Structural Engineering, Construction Engineering, and more.\n- M.Arch in Architecture <a href ='https://srmrmp.edu.in/admission-srm-ramapuram/' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "facilities",
      "patterns": [
        "What are the campus facilities?",
        "Facilities at SRM",
        "Campus infrastructure",
        "What services does SRM Ramapuram offer?",
        "What facilities are on campus?",
        "Can you tell me about the campus facilities?",
        "What amenities does the campus have?",
        "What can I find on campus?",
        "What services are available on campus?",
        "What are the facilities at the campus?",
        "What do you have at the campus?",
        "What resources are there on campus?",
        "Can you list the campus facilities?",
        "What is available at the campus?",
        "What facilities does SRM have?",
        "Can you tell me about SRM campus facilities?",
        "What is on the SRM campus?",
        "What can I find at SRM?",
        "What services are at SRM?",
        "What facilities does SRM provide?",
        "What do you have at SRM campus?",
        "What amenities are at SRM?",
        "Can you list SRM campus facilities?",
        "What is available at SRM campus?",
        "Can I know about SRM facilities?",
        "What facilities are at SRM?",
        "What facilities does SRM have?",
        "What facilities can I find at SRM?",
        "Can you tell me about SRM facilities?",
        "What are the facilities in SRM?",
        "What SRM facilities can I use?",
        "What facilities help me at SRM?",
        "What facilities are available in SRM?",
        "What is included in SRM facilities?",
        "What are the main facilities at SRM?"
      ],
      "responses": [
        "Our campus offers a variety of facilities including:\n- Air-conditioned auditoriums\n- Hostels for men and women\n- A well-stocked library\n- Medical and transport services\n- Banking and Xerox facilities \n Ensuring a comfortable and supportive environment for students."
      ]
    },
    {
      "tag": "contact",
      "patterns": [
        "What is the contact information?",
        "how to contact",
        "contact",
        "contact information",
        "How can I reach SRM Ramapuram?",
        "Where is SRM located?",
        "What's SRM Ramapuram's phone number?",
        "How can I contact?",
        "What is the way to contact?",
        "Can you tell me how to contact?",
        "How do I get in touch?",
        "What is the contact method?",
        "How do I reach out?",
        "Can you help me contact?",
        "What is the best way to contact?",
        "How to get in contact?",
        "How can I reach you?",
        "How can I contact SRM?",
        "What is the way to contact SRM?",
        "Can you tell me how to contact SRM?",
        "How do I get in touch with SRM?",
        "What is the contact method for SRM?",
        "How do I reach out to SRM?",
        "Can you help me contact SRM?",
        "What is the best way to contact SRM?",
        "How to get in contact with SRM?",
        "How can I reach SRM?"
      ],
      "responses": [
        "You can contact SRM Ramapuram at Bharathi Salai, Ramapuram, Chennai  600 089.\nPhone: 044 4392 3042 / 044 4392 3133\nEmail: helpdesk@srmrmp.edu.in"
      ]
    },
    {
      "tag": "scholarships",
      "patterns": [
        "Can I get a scholarship or financial aid?",
        "Is there a scholarship option for students?",
        "Do you offer financial aid for students?",
        "Can students apply for scholarships or aid?",
        "Are there scholarships available for students?",
        "Is there any financial aid for students?",
        "Can I get help with fees through scholarships?",
        "What scholarships are available for students?",
        "Is financial aid offered to students?",
        "Are scholarships or financial help available?",
        "Can I get a scholarship?",
        "Is there financial aid?",
        "Are there any scholarships?",
        "Do you offer scholarships?",
        "Can I get help with fees?",
        "Is there fee support?",
        "Are scholarships available?",
        "Can I apply for financial aid?",
        "Do you give scholarships to students?",
        "Can I get fee assistance?",
        "Can I get fee help?",
        "Is there money support?",
        "Are there student scholarships?",
        "Can I apply for aid?",
        "Is there fee assistance?",
        "Do you have scholarships?",
        "Can I get a grant?",
        "Is there support for paying fees?",
        "Can I get help with tuition?",
        "Do you have financial help for students?"
      ],
      "responses": [
        "Yes, SRM offers several scholarships for meritorious students, including Founder's Scholarship, SRM Merit Scholarship, and many others. For more details, visit the SRM scholarships page or contact admissions <a href ='https://admissions.srmist.edu.in/srmistonline/applicationist/loginManager/youLogin.jsp' target='_blank'>click here</a>."
      ]
    },
    {
      "tag": "hostel",
      "patterns": [
        "Do you have hostel facilities?",
        "Is there accommodation?",
        "What are the hostel options?",
        "What are the hostel facilities in SRM?",
        "Can you tell me about SRM's hostel facilities?",
        "What is included in the hostel facilities at SRM?",
        "What can I find in the hostels at SRM?",
        "How are the hostel facilities in SRM?",
        "What do the hostels offer in SRM?",
        "Can you describe the hostel facilities in SRM?",
        "What is available in SRM hostels?",
        "Tell me about the SRM hostel services.",
        "What do SRM hostels provide?",
        "What is in the SRM hostel?",
        "Can I know about SRM hostel facilities?",
        "What do SRM hostels have?",
        "How are the hostels at SRM?",
        "What is provided in SRM hostels?",
        "Do SRM hostels offer Wi-Fi?",
        "What is available in SRM hostel?",
        "Are there study rooms in SRM hostel?",
        "What services do SRM hostels provide?",
        "Is food available in SRM hostels?",
        "What is in SRM hostel?",
        "What do SRM hostels offer?",
        "How are the hostels at SRM?",
        "What is at SRM hostel?",
        "Is there Wi-Fi in SRM hostel?",
        "Do SRM hostels have food?",
        "Are there study areas in SRM hostel?",
        "What facilities are in SRM hostel?",
        "Can I study in SRM hostel?",
        "What is good about SRM hostel?"
      ],
      "responses": [
        "Yes, we offer hostel facilities for both men and women with various amenities. You can choose between single and shared rooms, with mess and other facilities like Wi-Fi, study areas, recreational rooms, and 24/7 security to ensure a safe and enjoyable living experience for students"
      ]
    }
  ]
}